blogger-refactor/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT 1
---
  def index
    @articles = Article.ordered_by(params[:order_by])

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "He's sharply dressed"], ["created_at", Thu, 14 Feb 2013 18:30:22 UTC +00:00], ["title", "Santa CLAWS is Coming To Town!"], ["updated_at", Thu, 14 Feb 2013 18:30:22 UTC +00:00]]
---
  def create
    @article = Article.create params[:article]

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "body" = 'I love the chocolate chip ones!', "updated_at" = '2013-02-14 18:56:08.795886' WHERE "articles"."id" = 1
---
  def update
    @article = Article.find(params[:id])

    # An alternative to updating the article
    # Article.update @article, params[:article]

    if @article.update_attributes params[:article]