blogger-refactor/app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @author = Author.find(params[:id])

INSERT INTO "authors" ("created_at", "crypted_password", "email", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "authors" SET "email" = 'admin@admin2.com', "updated_at" = '2013-05-09 21:06:43.301721' WHERE "authors"."id" = 1
---
  def update

    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(author_params)

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 3]]
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy