blogger-refactor/app/views/articles/_article.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = 1
---
  <%= link_to article.title, article_path(article) %>
  <%= "#{article.comments.length} comments" %>